susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L15xxA.h
/*
 * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
 * Timestamp: 2022-12-19T23:52:17.217713
 */

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define _I2C2_SCL_PB10_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define _I2C2_SDA_PB11_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PD1_ PD1,GPIO_AF5
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD1_ 1

#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define I2S2_SD_PD4_ PD4,GPIO_AF5
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PD4_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PD0_ PD0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PD0_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define LCD_COM0_PA8_ PA8,GPIO_AF11
#define _LCD_COM0_PA8_ 1

#define LCD_COM1_PA9_ PA9,GPIO_AF11
#define _LCD_COM1_PA9_ 1

#define LCD_COM2_PA10_ PA10,GPIO_AF11
#define _LCD_COM2_PA10_ 1

#define LCD_COM3_PB9_ PB9,GPIO_AF11
#define _LCD_COM3_PB9_ 1

#define LCD_COM4_PC10_ PC10,GPIO_AF11
#define _LCD_COM4_PC10_ 1

#define LCD_COM5_PC11_ PC11,GPIO_AF11
#define _LCD_COM5_PC11_ 1

#define LCD_COM6_PC12_ PC12,GPIO_AF11
#define _LCD_COM6_PC12_ 1

#define LCD_COM7_PD2_ PD2,GPIO_AF11
#define _LCD_COM7_PD2_ 1

#define LCD_SEG0_PA1_ PA1,GPIO_AF11
#define _LCD_SEG0_PA1_ 1

#define LCD_SEG1_PA2_ PA2,GPIO_AF11
#define _LCD_SEG1_PA2_ 1

#define LCD_SEG10_PB10_ PB10,GPIO_AF11
#define _LCD_SEG10_PB10_ 1

#define LCD_SEG11_PB11_ PB11,GPIO_AF11
#define _LCD_SEG11_PB11_ 1

#define LCD_SEG12_PB12_ PB12,GPIO_AF11
#define _LCD_SEG12_PB12_ 1

#define LCD_SEG13_PB13_ PB13,GPIO_AF11
#define _LCD_SEG13_PB13_ 1

#define LCD_SEG14_PB14_ PB14,GPIO_AF11
#define _LCD_SEG14_PB14_ 1

#define LCD_SEG15_PB15_ PB15,GPIO_AF11
#define _LCD_SEG15_PB15_ 1

#define LCD_SEG16_PB8_ PB8,GPIO_AF11
#define _LCD_SEG16_PB8_ 1

#define LCD_SEG17_PA15_ PA15,GPIO_AF11
#define _LCD_SEG17_PA15_ 1

#define LCD_SEG18_PC0_ PC0,GPIO_AF11
#define _LCD_SEG18_PC0_ 1

#define LCD_SEG19_PC1_ PC1,GPIO_AF11
#define _LCD_SEG19_PC1_ 1

#define LCD_SEG2_PA3_ PA3,GPIO_AF11
#define _LCD_SEG2_PA3_ 1

#define LCD_SEG20_PC2_ PC2,GPIO_AF11
#define _LCD_SEG20_PC2_ 1

#define LCD_SEG21_PC3_ PC3,GPIO_AF11
#define _LCD_SEG21_PC3_ 1

#define LCD_SEG22_PC4_ PC4,GPIO_AF11
#define _LCD_SEG22_PC4_ 1

#define LCD_SEG23_PC5_ PC5,GPIO_AF11
#define _LCD_SEG23_PC5_ 1

#define LCD_SEG24_PC6_ PC6,GPIO_AF11
#define _LCD_SEG24_PC6_ 1

#define LCD_SEG25_PC7_ PC7,GPIO_AF11
#define _LCD_SEG25_PC7_ 1

#define LCD_SEG26_PC8_ PC8,GPIO_AF11
#define _LCD_SEG26_PC8_ 1

#define LCD_SEG27_PC9_ PC9,GPIO_AF11
#define _LCD_SEG27_PC9_ 1

#define LCD_SEG28_PC10_ PC10,GPIO_AF11
#define LCD_SEG28_PD8_ PD8,GPIO_AF11
#define _LCD_SEG28_PC10_ 1
#define _LCD_SEG28_PD8_ 1

#define LCD_SEG29_PC11_ PC11,GPIO_AF11
#define LCD_SEG29_PD9_ PD9,GPIO_AF11
#define _LCD_SEG29_PC11_ 1
#define _LCD_SEG29_PD9_ 1

#define LCD_SEG3_PA6_ PA6,GPIO_AF11
#define _LCD_SEG3_PA6_ 1

#define LCD_SEG30_PC12_ PC12,GPIO_AF11
#define LCD_SEG30_PD10_ PD10,GPIO_AF11
#define _LCD_SEG30_PC12_ 1
#define _LCD_SEG30_PD10_ 1

#define LCD_SEG31_PD11_ PD11,GPIO_AF11
#define LCD_SEG31_PD2_ PD2,GPIO_AF11
#define _LCD_SEG31_PD11_ 1
#define _LCD_SEG31_PD2_ 1

#define LCD_SEG32_PD12_ PD12,GPIO_AF11
#define _LCD_SEG32_PD12_ 1

#define LCD_SEG33_PD13_ PD13,GPIO_AF11
#define _LCD_SEG33_PD13_ 1

#define LCD_SEG34_PD14_ PD14,GPIO_AF11
#define _LCD_SEG34_PD14_ 1

#define LCD_SEG35_PD15_ PD15,GPIO_AF11
#define _LCD_SEG35_PD15_ 1

#define LCD_SEG36_PE0_ PE0,GPIO_AF11
#define _LCD_SEG36_PE0_ 1

#define LCD_SEG37_PE1_ PE1,GPIO_AF11
#define _LCD_SEG37_PE1_ 1

#define LCD_SEG38_PE2_ PE2,GPIO_AF11
#define _LCD_SEG38_PE2_ 1

#define LCD_SEG39_PE3_ PE3,GPIO_AF11
#define _LCD_SEG39_PE3_ 1

#define LCD_SEG4_PA7_ PA7,GPIO_AF11
#define _LCD_SEG4_PA7_ 1

#define LCD_SEG40_PC10_ PC10,GPIO_AF11
#define _LCD_SEG40_PC10_ 1

#define LCD_SEG41_PC11_ PC11,GPIO_AF11
#define _LCD_SEG41_PC11_ 1

#define LCD_SEG42_PC12_ PC12,GPIO_AF11
#define _LCD_SEG42_PC12_ 1

#define LCD_SEG43_PD2_ PD2,GPIO_AF11
#define _LCD_SEG43_PD2_ 1

#define LCD_SEG5_PB0_ PB0,GPIO_AF11
#define _LCD_SEG5_PB0_ 1

#define LCD_SEG6_PB1_ PB1,GPIO_AF11
#define _LCD_SEG6_PB1_ 1

#define LCD_SEG7_PB3_ PB3,GPIO_AF11
#define _LCD_SEG7_PB3_ 1

#define LCD_SEG8_PB4_ PB4,GPIO_AF11
#define _LCD_SEG8_PB4_ 1

#define LCD_SEG9_PB5_ PB5,GPIO_AF11
#define _LCD_SEG9_PB5_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RCC_OSC32_IN_PC14_ PC14,GPIO_AF0
#define _RCC_OSC32_IN_PC14_ 1

#define RCC_OSC32_OUT_PC15_ PC15,GPIO_AF0
#define _RCC_OSC32_OUT_PC15_ 1

#define RCC_OSC_IN_PH0_ PH0,GPIO_AF0
#define _RCC_OSC_IN_PH0_ 1

#define RCC_OSC_OUT_PH1_ PH1,GPIO_AF0
#define _RCC_OSC_OUT_PH1_ 1

#define RTC_OUT_ALARM_PC13_ PC13,GPIO_AF0
#define _RTC_OUT_ALARM_PC13_ 1

#define RTC_OUT_CALIB_PC13_ PC13,GPIO_AF0
#define _RTC_OUT_CALIB_PC13_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define RTC_TAMP1_PC13_ PC13,GPIO_AF0
#define _RTC_TAMP1_PC13_ 1

#define RTC_TAMP2_PA0_ PA0,GPIO_AF0
#define _RTC_TAMP2_PA0_ 1

#define RTC_TAMP3_PE6_ PE6,GPIO_AF0
#define _RTC_TAMP3_PE6_ 1

#define RTC_TS_PC13_ PC13,GPIO_AF0
#define _RTC_TS_PC13_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define SPI1_MISO_PE14_ PE14,GPIO_AF5
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PE14_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF5
#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PE15_ PE15,GPIO_AF5
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PE15_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PE12_ PE12,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PE12_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define SPI1_SCK_PE13_ PE13,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PE13_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PD3_ PD3,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PD4_ PD4,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PD0_ 1

#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD1_ PD1,GPIO_AF5
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_TRACESWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_TRACESWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define SYS_TRACECK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECK_PE2_ 1

#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define _SYS_TRACED0_PE3_ 1

#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define _SYS_TRACED1_PE4_ 1

#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define _SYS_TRACED2_PE5_ 1

#define SYS_TRACED3_PE6_ PE6,GPIO_AF0
#define _SYS_TRACED3_PE6_ 1

#define SYS_WKUP1_PA0_ PA0,GPIO_AF0
#define _SYS_WKUP1_PA0_ 1

#define SYS_WKUP2_PC13_ PC13,GPIO_AF0
#define _SYS_WKUP2_PC13_ 1

#define SYS_WKUP3_PE6_ PE6,GPIO_AF0
#define _SYS_WKUP3_PE6_ 1

#define TIM10_CH1_PA6_ PA6,GPIO_AF3
#define TIM10_CH1_PB12_ PB12,GPIO_AF3
#define TIM10_CH1_PB8_ PB8,GPIO_AF3
#define TIM10_CH1_PE0_ PE0,GPIO_AF3
#define _TIM10_CH1_PA6_ 1
#define _TIM10_CH1_PB12_ 1
#define _TIM10_CH1_PB8_ 1
#define _TIM10_CH1_PE0_ 1

#define TIM11_CH1_PA7_ PA7,GPIO_AF3
#define TIM11_CH1_PB15_ PB15,GPIO_AF3
#define TIM11_CH1_PB9_ PB9,GPIO_AF3
#define TIM11_CH1_PE1_ PE1,GPIO_AF3
#define _TIM11_CH1_PA7_ 1
#define _TIM11_CH1_PB15_ 1
#define _TIM11_CH1_PB9_ 1
#define _TIM11_CH1_PE1_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define TIM2_CH1_PE9_ PE9,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PE9_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define TIM2_CH2_PE10_ PE10,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1
#define _TIM2_CH2_PE10_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define TIM2_CH3_PE11_ PE11,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1
#define _TIM2_CH3_PE11_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define TIM2_CH4_PE12_ PE12,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1
#define _TIM2_CH4_PE12_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define TIM3_CH1_PE3_ PE3,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE3_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define TIM3_CH2_PE4_ PE4,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE4_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define TIM3_ETR_PE2_ PE2,GPIO_AF2
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PE0_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define _TIM5_CH1_PA0_ 1

#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define _TIM5_CH2_PA1_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define _TIM5_CH3_PA2_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define _TIM5_CH4_PA3_ 1

#define TIM5_ETR_PE9_ PE9,GPIO_AF2
#define _TIM5_ETR_PE9_ 1

#define TIM9_CH1_PA2_ PA2,GPIO_AF3
#define TIM9_CH1_PB13_ PB13,GPIO_AF3
#define TIM9_CH1_PD0_ PD0,GPIO_AF3
#define TIM9_CH1_PE5_ PE5,GPIO_AF3
#define _TIM9_CH1_PA2_ 1
#define _TIM9_CH1_PB13_ 1
#define _TIM9_CH1_PD0_ 1
#define _TIM9_CH1_PE5_ 1

#define TIM9_CH2_PA3_ PA3,GPIO_AF3
#define TIM9_CH2_PB14_ PB14,GPIO_AF3
#define TIM9_CH2_PD7_ PD7,GPIO_AF3
#define TIM9_CH2_PE6_ PE6,GPIO_AF3
#define _TIM9_CH2_PA3_ 1
#define _TIM9_CH2_PB14_ 1
#define _TIM9_CH2_PD7_ 1
#define _TIM9_CH2_PE6_ 1

#define TIMX_IC1_PA0_ PA0,GPIO_AF14
#define TIMX_IC1_PA12_ PA12,GPIO_AF14
#define TIMX_IC1_PA4_ PA4,GPIO_AF14
#define TIMX_IC1_PA8_ PA8,GPIO_AF14
#define TIMX_IC1_PC0_ PC0,GPIO_AF14
#define TIMX_IC1_PC12_ PC12,GPIO_AF14
#define TIMX_IC1_PC4_ PC4,GPIO_AF14
#define TIMX_IC1_PC8_ PC8,GPIO_AF14
#define TIMX_IC1_PD0_ PD0,GPIO_AF14
#define TIMX_IC1_PD12_ PD12,GPIO_AF14
#define TIMX_IC1_PD4_ PD4,GPIO_AF14
#define TIMX_IC1_PD8_ PD8,GPIO_AF14
#define TIMX_IC1_PE0_ PE0,GPIO_AF14
#define TIMX_IC1_PE12_ PE12,GPIO_AF14
#define TIMX_IC1_PE4_ PE4,GPIO_AF14
#define TIMX_IC1_PE8_ PE8,GPIO_AF14
#define _TIMX_IC1_PA0_ 1
#define _TIMX_IC1_PA12_ 1
#define _TIMX_IC1_PA4_ 1
#define _TIMX_IC1_PA8_ 1
#define _TIMX_IC1_PC0_ 1
#define _TIMX_IC1_PC12_ 1
#define _TIMX_IC1_PC4_ 1
#define _TIMX_IC1_PC8_ 1
#define _TIMX_IC1_PD0_ 1
#define _TIMX_IC1_PD12_ 1
#define _TIMX_IC1_PD4_ 1
#define _TIMX_IC1_PD8_ 1
#define _TIMX_IC1_PE0_ 1
#define _TIMX_IC1_PE12_ 1
#define _TIMX_IC1_PE4_ 1
#define _TIMX_IC1_PE8_ 1

#define TIMX_IC2_PA1_ PA1,GPIO_AF14
#define TIMX_IC2_PA13_ PA13,GPIO_AF14
#define TIMX_IC2_PA5_ PA5,GPIO_AF14
#define TIMX_IC2_PA9_ PA9,GPIO_AF14
#define TIMX_IC2_PC1_ PC1,GPIO_AF14
#define TIMX_IC2_PC13_ PC13,GPIO_AF14
#define TIMX_IC2_PC5_ PC5,GPIO_AF14
#define TIMX_IC2_PC9_ PC9,GPIO_AF14
#define TIMX_IC2_PD1_ PD1,GPIO_AF14
#define TIMX_IC2_PD13_ PD13,GPIO_AF14
#define TIMX_IC2_PD5_ PD5,GPIO_AF14
#define TIMX_IC2_PD9_ PD9,GPIO_AF14
#define TIMX_IC2_PE1_ PE1,GPIO_AF14
#define TIMX_IC2_PE13_ PE13,GPIO_AF14
#define TIMX_IC2_PE5_ PE5,GPIO_AF14
#define TIMX_IC2_PE9_ PE9,GPIO_AF14
#define _TIMX_IC2_PA1_ 1
#define _TIMX_IC2_PA13_ 1
#define _TIMX_IC2_PA5_ 1
#define _TIMX_IC2_PA9_ 1
#define _TIMX_IC2_PC1_ 1
#define _TIMX_IC2_PC13_ 1
#define _TIMX_IC2_PC5_ 1
#define _TIMX_IC2_PC9_ 1
#define _TIMX_IC2_PD1_ 1
#define _TIMX_IC2_PD13_ 1
#define _TIMX_IC2_PD5_ 1
#define _TIMX_IC2_PD9_ 1
#define _TIMX_IC2_PE1_ 1
#define _TIMX_IC2_PE13_ 1
#define _TIMX_IC2_PE5_ 1
#define _TIMX_IC2_PE9_ 1

#define TIMX_IC3_PA10_ PA10,GPIO_AF14
#define TIMX_IC3_PA14_ PA14,GPIO_AF14
#define TIMX_IC3_PA2_ PA2,GPIO_AF14
#define TIMX_IC3_PA6_ PA6,GPIO_AF14
#define TIMX_IC3_PC10_ PC10,GPIO_AF14
#define TIMX_IC3_PC14_ PC14,GPIO_AF14
#define TIMX_IC3_PC2_ PC2,GPIO_AF14
#define TIMX_IC3_PC6_ PC6,GPIO_AF14
#define TIMX_IC3_PD10_ PD10,GPIO_AF14
#define TIMX_IC3_PD14_ PD14,GPIO_AF14
#define TIMX_IC3_PD2_ PD2,GPIO_AF14
#define TIMX_IC3_PD6_ PD6,GPIO_AF14
#define TIMX_IC3_PE10_ PE10,GPIO_AF14
#define TIMX_IC3_PE14_ PE14,GPIO_AF14
#define TIMX_IC3_PE2_ PE2,GPIO_AF14
#define TIMX_IC3_PE6_ PE6,GPIO_AF14
#define _TIMX_IC3_PA10_ 1
#define _TIMX_IC3_PA14_ 1
#define _TIMX_IC3_PA2_ 1
#define _TIMX_IC3_PA6_ 1
#define _TIMX_IC3_PC10_ 1
#define _TIMX_IC3_PC14_ 1
#define _TIMX_IC3_PC2_ 1
#define _TIMX_IC3_PC6_ 1
#define _TIMX_IC3_PD10_ 1
#define _TIMX_IC3_PD14_ 1
#define _TIMX_IC3_PD2_ 1
#define _TIMX_IC3_PD6_ 1
#define _TIMX_IC3_PE10_ 1
#define _TIMX_IC3_PE14_ 1
#define _TIMX_IC3_PE2_ 1
#define _TIMX_IC3_PE6_ 1

#define TIMX_IC4_PA11_ PA11,GPIO_AF14
#define TIMX_IC4_PA15_ PA15,GPIO_AF14
#define TIMX_IC4_PA3_ PA3,GPIO_AF14
#define TIMX_IC4_PA7_ PA7,GPIO_AF14
#define TIMX_IC4_PC11_ PC11,GPIO_AF14
#define TIMX_IC4_PC15_ PC15,GPIO_AF14
#define TIMX_IC4_PC3_ PC3,GPIO_AF14
#define TIMX_IC4_PC7_ PC7,GPIO_AF14
#define TIMX_IC4_PD11_ PD11,GPIO_AF14
#define TIMX_IC4_PD15_ PD15,GPIO_AF14
#define TIMX_IC4_PD3_ PD3,GPIO_AF14
#define TIMX_IC4_PD7_ PD7,GPIO_AF14
#define TIMX_IC4_PE11_ PE11,GPIO_AF14
#define TIMX_IC4_PE15_ PE15,GPIO_AF14
#define TIMX_IC4_PE3_ PE3,GPIO_AF14
#define TIMX_IC4_PE7_ PE7,GPIO_AF14
#define _TIMX_IC4_PA11_ 1
#define _TIMX_IC4_PA15_ 1
#define _TIMX_IC4_PA3_ 1
#define _TIMX_IC4_PA7_ 1
#define _TIMX_IC4_PC11_ 1
#define _TIMX_IC4_PC15_ 1
#define _TIMX_IC4_PC3_ 1
#define _TIMX_IC4_PC7_ 1
#define _TIMX_IC4_PD11_ 1
#define _TIMX_IC4_PD15_ 1
#define _TIMX_IC4_PD3_ 1
#define _TIMX_IC4_PD7_ 1
#define _TIMX_IC4_PE11_ 1
#define _TIMX_IC4_PE15_ 1
#define _TIMX_IC4_PE3_ 1
#define _TIMX_IC4_PE7_ 1

#define TS_G10_IO1_PC6_ PC6,GPIO_AF14
#define _TS_G10_IO1_PC6_ 1

#define TS_G10_IO2_PC7_ PC7,GPIO_AF14
#define _TS_G10_IO2_PC7_ 1

#define TS_G10_IO3_PC8_ PC8,GPIO_AF14
#define _TS_G10_IO3_PC8_ 1

#define TS_G10_IO4_PC9_ PC9,GPIO_AF14
#define _TS_G10_IO4_PC9_ 1

#define TS_G1_IO1_PA0_ PA0,GPIO_AF14
#define _TS_G1_IO1_PA0_ 1

#define TS_G1_IO2_PA1_ PA1,GPIO_AF14
#define _TS_G1_IO2_PA1_ 1

#define TS_G1_IO3_PA2_ PA2,GPIO_AF14
#define _TS_G1_IO3_PA2_ 1

#define TS_G1_IO4_PA3_ PA3,GPIO_AF14
#define _TS_G1_IO4_PA3_ 1

#define TS_G2_IO1_PA6_ PA6,GPIO_AF14
#define _TS_G2_IO1_PA6_ 1

#define TS_G2_IO2_PA7_ PA7,GPIO_AF14
#define _TS_G2_IO2_PA7_ 1

#define TS_G3_IO1_PB0_ PB0,GPIO_AF14
#define _TS_G3_IO1_PB0_ 1

#define TS_G3_IO2_PB1_ PB1,GPIO_AF14
#define _TS_G3_IO2_PB1_ 1

#define TS_G3_IO3_PB2_ PB2,GPIO_AF14
#define _TS_G3_IO3_PB2_ 1

#define TS_G4_IO1_PA8_ PA8,GPIO_AF14
#define _TS_G4_IO1_PA8_ 1

#define TS_G4_IO2_PA9_ PA9,GPIO_AF14
#define _TS_G4_IO2_PA9_ 1

#define TS_G4_IO3_PA10_ PA10,GPIO_AF14
#define _TS_G4_IO3_PA10_ 1

#define TS_G5_IO1_PA13_ PA13,GPIO_AF14
#define _TS_G5_IO1_PA13_ 1

#define TS_G5_IO2_PA14_ PA14,GPIO_AF14
#define _TS_G5_IO2_PA14_ 1

#define TS_G5_IO3_PA15_ PA15,GPIO_AF14
#define _TS_G5_IO3_PA15_ 1

#define TS_G6_IO1_PB4_ PB4,GPIO_AF14
#define _TS_G6_IO1_PB4_ 1

#define TS_G6_IO2_PB5_ PB5,GPIO_AF14
#define _TS_G6_IO2_PB5_ 1

#define TS_G6_IO3_PB6_ PB6,GPIO_AF14
#define _TS_G6_IO3_PB6_ 1

#define TS_G6_IO4_PB7_ PB7,GPIO_AF14
#define _TS_G6_IO4_PB7_ 1

#define TS_G7_IO1_PB12_ PB12,GPIO_AF14
#define _TS_G7_IO1_PB12_ 1

#define TS_G7_IO2_PB13_ PB13,GPIO_AF14
#define _TS_G7_IO2_PB13_ 1

#define TS_G7_IO3_PB14_ PB14,GPIO_AF14
#define _TS_G7_IO3_PB14_ 1

#define TS_G7_IO4_PB15_ PB15,GPIO_AF14
#define _TS_G7_IO4_PB15_ 1

#define TS_G8_IO1_PC0_ PC0,GPIO_AF14
#define _TS_G8_IO1_PC0_ 1

#define TS_G8_IO2_PC1_ PC1,GPIO_AF14
#define _TS_G8_IO2_PC1_ 1

#define TS_G8_IO3_PC2_ PC2,GPIO_AF14
#define _TS_G8_IO3_PC2_ 1

#define TS_G8_IO4_PC3_ PC3,GPIO_AF14
#define _TS_G8_IO4_PC3_ 1

#define TS_G9_IO1_PC4_ PC4,GPIO_AF14
#define _TS_G9_IO1_PC4_ 1

#define TS_G9_IO2_PC5_ PC5,GPIO_AF14
#define _TS_G9_IO2_PC5_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define _USART1_CTS_PA11_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define USART2_CK_PD7_ PD7,GPIO_AF7
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define USART2_CTS_PD3_ PD3,GPIO_AF7
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define USART2_RTS_PD4_ PD4,GPIO_AF7
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PD6_ PD6,GPIO_AF7
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PD5_ PD5,GPIO_AF7
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB12_ PB12,GPIO_AF7
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define USART3_CK_PD10_ PD10,GPIO_AF7
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PB13_ PB13,GPIO_AF7
#define USART3_CTS_PD11_ PD11,GPIO_AF7
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_RTS_PB14_ PB14,GPIO_AF7
#define USART3_RTS_PD12_ PD12,GPIO_AF7
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PC11_ PC11,GPIO_AF7
#define USART3_RX_PD9_ PD9,GPIO_AF7
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define USART3_TX_PD8_ PD8,GPIO_AF7
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PD8_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */